virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAML22N18A_DFP/component/evsys.h
#define EVSYS_CHANNEL_EVGEN_Pos               _U_(0)                                               /**< (EVSYS_CHANNEL) Event Generator Selection Position */
#define EVSYS_CHANNEL_EVGEN_Msk               (_U_(0x7F) << EVSYS_CHANNEL_EVGEN_Pos)               /**< (EVSYS_CHANNEL) Event Generator Selection Mask */
#define EVSYS_CHANNEL_EVGEN(value)            (EVSYS_CHANNEL_EVGEN_Msk & ((value) << EVSYS_CHANNEL_EVGEN_Pos))
#define EVSYS_CHANNEL_PATH_Pos                _U_(8)                                               /**< (EVSYS_CHANNEL) Path Selection Position */
#define EVSYS_CHANNEL_PATH_Msk                (_U_(0x3) << EVSYS_CHANNEL_PATH_Pos)                 /**< (EVSYS_CHANNEL) Path Selection Mask */
#define EVSYS_CHANNEL_PATH(value)             (EVSYS_CHANNEL_PATH_Msk & ((value) << EVSYS_CHANNEL_PATH_Pos))
#define   EVSYS_CHANNEL_PATH_SYNCHRONOUS_Val  _U_(0x0)                                             /**< (EVSYS_CHANNEL) Synchronous path  */
#define   EVSYS_CHANNEL_PATH_RESYNCHRONIZED_Val _U_(0x1)                                             /**< (EVSYS_CHANNEL) Resynchronized path  */
#define   EVSYS_CHANNEL_PATH_ASYNCHRONOUS_Val _U_(0x2)                                             /**< (EVSYS_CHANNEL) Asynchronous path  */
#define EVSYS_CHANNEL_PATH_SYNCHRONOUS        (EVSYS_CHANNEL_PATH_SYNCHRONOUS_Val << EVSYS_CHANNEL_PATH_Pos) /**< (EVSYS_CHANNEL) Synchronous path Position  */
#define EVSYS_CHANNEL_PATH_RESYNCHRONIZED     (EVSYS_CHANNEL_PATH_RESYNCHRONIZED_Val << EVSYS_CHANNEL_PATH_Pos) /**< (EVSYS_CHANNEL) Resynchronized path Position  */
#define EVSYS_CHANNEL_PATH_ASYNCHRONOUS       (EVSYS_CHANNEL_PATH_ASYNCHRONOUS_Val << EVSYS_CHANNEL_PATH_Pos) /**< (EVSYS_CHANNEL) Asynchronous path Position  */
#define EVSYS_CHANNEL_EDGSEL_Pos              _U_(10)                                              /**< (EVSYS_CHANNEL) Edge Detection Selection Position */
#define EVSYS_CHANNEL_EDGSEL_Msk              (_U_(0x3) << EVSYS_CHANNEL_EDGSEL_Pos)               /**< (EVSYS_CHANNEL) Edge Detection Selection Mask */
#define EVSYS_CHANNEL_EDGSEL(value)           (EVSYS_CHANNEL_EDGSEL_Msk & ((value) << EVSYS_CHANNEL_EDGSEL_Pos))
#define   EVSYS_CHANNEL_EDGSEL_NO_EVT_OUTPUT_Val _U_(0x0)                                             /**< (EVSYS_CHANNEL) No event output when using the resynchronized or synchronous path  */
#define   EVSYS_CHANNEL_EDGSEL_RISING_EDGE_Val _U_(0x1)                                             /**< (EVSYS_CHANNEL) Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path  */
#define   EVSYS_CHANNEL_EDGSEL_FALLING_EDGE_Val _U_(0x2)                                             /**< (EVSYS_CHANNEL) Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path  */
#define   EVSYS_CHANNEL_EDGSEL_BOTH_EDGES_Val _U_(0x3)                                             /**< (EVSYS_CHANNEL) Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path  */
#define EVSYS_CHANNEL_EDGSEL_NO_EVT_OUTPUT    (EVSYS_CHANNEL_EDGSEL_NO_EVT_OUTPUT_Val << EVSYS_CHANNEL_EDGSEL_Pos) /**< (EVSYS_CHANNEL) No event output when using the resynchronized or synchronous path Position  */
#define EVSYS_CHANNEL_EDGSEL_RISING_EDGE      (EVSYS_CHANNEL_EDGSEL_RISING_EDGE_Val << EVSYS_CHANNEL_EDGSEL_Pos) /**< (EVSYS_CHANNEL) Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path Position  */
#define EVSYS_CHANNEL_EDGSEL_FALLING_EDGE     (EVSYS_CHANNEL_EDGSEL_FALLING_EDGE_Val << EVSYS_CHANNEL_EDGSEL_Pos) /**< (EVSYS_CHANNEL) Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path Position  */
#define EVSYS_CHANNEL_EDGSEL_BOTH_EDGES       (EVSYS_CHANNEL_EDGSEL_BOTH_EDGES_Val << EVSYS_CHANNEL_EDGSEL_Pos) /**< (EVSYS_CHANNEL) Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path Position  */
#define EVSYS_CHANNEL_RUNSTDBY_Pos            _U_(14)                                              /**< (EVSYS_CHANNEL) Run in standby Position */
#define EVSYS_CHANNEL_RUNSTDBY_Msk            (_U_(0x1) << EVSYS_CHANNEL_RUNSTDBY_Pos)             /**< (EVSYS_CHANNEL) Run in standby Mask */
#define EVSYS_CHANNEL_RUNSTDBY(value)         (EVSYS_CHANNEL_RUNSTDBY_Msk & ((value) << EVSYS_CHANNEL_RUNSTDBY_Pos))
#define EVSYS_CHANNEL_ONDEMAND_Pos            _U_(15)                                              /**< (EVSYS_CHANNEL) Generic Clock On Demand Position */
#define EVSYS_CHANNEL_ONDEMAND_Msk            (_U_(0x1) << EVSYS_CHANNEL_ONDEMAND_Pos)             /**< (EVSYS_CHANNEL) Generic Clock On Demand Mask */
#define EVSYS_CHANNEL_ONDEMAND(value)         (EVSYS_CHANNEL_ONDEMAND_Msk & ((value) << EVSYS_CHANNEL_ONDEMAND_Pos))
#define EVSYS_CHANNEL_Msk                     _U_(0x0000CF7F)                                      /**< (EVSYS_CHANNEL) Register Mask  */


/* -------- EVSYS_USER : (EVSYS Offset: 0x80) (R/W 32) User Multiplexer n -------- */
#define EVSYS_USER_RESETVALUE                 _U_(0x00)                                            /**<  (EVSYS_USER) User Multiplexer n  Reset Value */

#define EVSYS_USER_CHANNEL_Pos                _U_(0)                                               /**< (EVSYS_USER) Channel Event Selection Position */
#define EVSYS_USER_CHANNEL_Msk                (_U_(0xF) << EVSYS_USER_CHANNEL_Pos)                 /**< (EVSYS_USER) Channel Event Selection Mask */
#define EVSYS_USER_CHANNEL(value)             (EVSYS_USER_CHANNEL_Msk & ((value) << EVSYS_USER_CHANNEL_Pos))
#define EVSYS_USER_Msk                        _U_(0x0000000F)                                      /**< (EVSYS_USER) Register Mask  */


/** \brief EVSYS register offsets definitions */
#define EVSYS_CTRLA_REG_OFST           (0x00)              /**< (EVSYS_CTRLA) Control Offset */
#define EVSYS_CHSTATUS_REG_OFST        (0x0C)              /**< (EVSYS_CHSTATUS) Channel Status Offset */
#define EVSYS_INTENCLR_REG_OFST        (0x10)              /**< (EVSYS_INTENCLR) Interrupt Enable Clear Offset */
#define EVSYS_INTENSET_REG_OFST        (0x14)              /**< (EVSYS_INTENSET) Interrupt Enable Set Offset */
#define EVSYS_INTFLAG_REG_OFST         (0x18)              /**< (EVSYS_INTFLAG) Interrupt Flag Status and Clear Offset */
#define EVSYS_SWEVT_REG_OFST           (0x1C)              /**< (EVSYS_SWEVT) Software Event Offset */
#define EVSYS_CHANNEL_REG_OFST         (0x20)              /**< (EVSYS_CHANNEL) Channel n Offset */
#define EVSYS_CHANNEL0_REG_OFST        (0x20)              /**< (EVSYS_CHANNEL0) Channel n Offset */
#define EVSYS_CHANNEL1_REG_OFST        (0x24)              /**< (EVSYS_CHANNEL1) Channel n Offset */
#define EVSYS_CHANNEL2_REG_OFST        (0x28)              /**< (EVSYS_CHANNEL2) Channel n Offset */
#define EVSYS_CHANNEL3_REG_OFST        (0x2C)              /**< (EVSYS_CHANNEL3) Channel n Offset */
#define EVSYS_CHANNEL4_REG_OFST        (0x30)              /**< (EVSYS_CHANNEL4) Channel n Offset */
#define EVSYS_CHANNEL5_REG_OFST        (0x34)              /**< (EVSYS_CHANNEL5) Channel n Offset */
#define EVSYS_CHANNEL6_REG_OFST        (0x38)              /**< (EVSYS_CHANNEL6) Channel n Offset */
#define EVSYS_CHANNEL7_REG_OFST        (0x3C)              /**< (EVSYS_CHANNEL7) Channel n Offset */
#define EVSYS_USER_REG_OFST            (0x80)              /**< (EVSYS_USER) User Multiplexer n Offset */
#define EVSYS_USER0_REG_OFST           (0x80)              /**< (EVSYS_USER0) User Multiplexer n Offset */
#define EVSYS_USER1_REG_OFST           (0x84)              /**< (EVSYS_USER1) User Multiplexer n Offset */
#define EVSYS_USER2_REG_OFST           (0x88)              /**< (EVSYS_USER2) User Multiplexer n Offset */
#define EVSYS_USER3_REG_OFST           (0x8C)              /**< (EVSYS_USER3) User Multiplexer n Offset */
#define EVSYS_USER4_REG_OFST           (0x90)              /**< (EVSYS_USER4) User Multiplexer n Offset */
#define EVSYS_USER5_REG_OFST           (0x94)              /**< (EVSYS_USER5) User Multiplexer n Offset */
#define EVSYS_USER6_REG_OFST           (0x98)              /**< (EVSYS_USER6) User Multiplexer n Offset */
#define EVSYS_USER7_REG_OFST           (0x9C)              /**< (EVSYS_USER7) User Multiplexer n Offset */
#define EVSYS_USER8_REG_OFST           (0xA0)              /**< (EVSYS_USER8) User Multiplexer n Offset */
#define EVSYS_USER9_REG_OFST           (0xA4)              /**< (EVSYS_USER9) User Multiplexer n Offset */
#define EVSYS_USER10_REG_OFST          (0xA8)              /**< (EVSYS_USER10) User Multiplexer n Offset */
#define EVSYS_USER11_REG_OFST          (0xAC)              /**< (EVSYS_USER11) User Multiplexer n Offset */
#define EVSYS_USER12_REG_OFST          (0xB0)              /**< (EVSYS_USER12) User Multiplexer n Offset */
#define EVSYS_USER13_REG_OFST          (0xB4)              /**< (EVSYS_USER13) User Multiplexer n Offset */
#define EVSYS_USER14_REG_OFST          (0xB8)              /**< (EVSYS_USER14) User Multiplexer n Offset */
#define EVSYS_USER15_REG_OFST          (0xBC)              /**< (EVSYS_USER15) User Multiplexer n Offset */
#define EVSYS_USER16_REG_OFST          (0xC0)              /**< (EVSYS_USER16) User Multiplexer n Offset */
#define EVSYS_USER17_REG_OFST          (0xC4)              /**< (EVSYS_USER17) User Multiplexer n Offset */
#define EVSYS_USER18_REG_OFST          (0xC8)              /**< (EVSYS_USER18) User Multiplexer n Offset */
#define EVSYS_USER19_REG_OFST          (0xCC)              /**< (EVSYS_USER19) User Multiplexer n Offset */
#define EVSYS_USER20_REG_OFST          (0xD0)              /**< (EVSYS_USER20) User Multiplexer n Offset */
#define EVSYS_USER21_REG_OFST          (0xD4)              /**< (EVSYS_USER21) User Multiplexer n Offset */
#define EVSYS_USER22_REG_OFST          (0xD8)              /**< (EVSYS_USER22) User Multiplexer n Offset */
#define EVSYS_USER23_REG_OFST          (0xDC)              /**< (EVSYS_USER23) User Multiplexer n Offset */
#define EVSYS_USER24_REG_OFST          (0xE0)              /**< (EVSYS_USER24) User Multiplexer n Offset */
#define EVSYS_USER25_REG_OFST          (0xE4)              /**< (EVSYS_USER25) User Multiplexer n Offset */
#define EVSYS_USER26_REG_OFST          (0xE8)              /**< (EVSYS_USER26) User Multiplexer n Offset */
#define EVSYS_USER27_REG_OFST          (0xEC)              /**< (EVSYS_USER27) User Multiplexer n Offset */
#define EVSYS_USER28_REG_OFST          (0xF0)              /**< (EVSYS_USER28) User Multiplexer n Offset */
#define EVSYS_USER29_REG_OFST          (0xF4)              /**< (EVSYS_USER29) User Multiplexer n Offset */
#define EVSYS_USER30_REG_OFST          (0xF8)              /**< (EVSYS_USER30) User Multiplexer n Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief EVSYS register API structure */
typedef struct
{  /* Event System Interface */
  __IO  uint8_t                        EVSYS_CTRLA;        /**< Offset: 0x00 (R/W  8) Control */
  __I   uint8_t                        Reserved1[0x0B];
  __I   uint32_t                       EVSYS_CHSTATUS;     /**< Offset: 0x0C (R/   32) Channel Status */
  __IO  uint32_t                       EVSYS_INTENCLR;     /**< Offset: 0x10 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       EVSYS_INTENSET;     /**< Offset: 0x14 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       EVSYS_INTFLAG;      /**< Offset: 0x18 (R/W  32) Interrupt Flag Status and Clear */
  __O   uint32_t                       EVSYS_SWEVT;        /**< Offset: 0x1C ( /W  32) Software Event */
  __IO  uint32_t                       EVSYS_CHANNEL[8];   /**< Offset: 0x20 (R/W  32) Channel n */
  __I   uint8_t                        Reserved2[0x40];
  __IO  uint32_t                       EVSYS_USER[31];     /**< Offset: 0x80 (R/W  32) User Multiplexer n */
} evsys_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAML22_EVSYS_COMPONENT_H_ */
